retrieval-tools/src/main/doc/lyricwiki/lyricwiki.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?><definitions xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:si="http://soapinterop.org/xsd" xmlns:tns="urn:LyricWiki" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:LyricWiki"><types><xsd:schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="urn:LyricWiki"
>
 <xsd:import namespace="http://schemas.xmlsoap.org/soap/encoding/" />
 <xsd:import namespace="http://schemas.xmlsoap.org/wsdl/" />
 <xsd:complexType name="ArrayOfstring">
  <xsd:complexContent>
   <xsd:restriction base="SOAP-ENC:Array">
    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="string[]"/>
   </xsd:restriction>
  </xsd:complexContent>
 </xsd:complexType>
 <xsd:complexType name="AlbumResultArray">
  <xsd:complexContent>
   <xsd:restriction base="SOAP-ENC:Array">
    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="tns:AlbumResult[]"/>
   </xsd:restriction>
  </xsd:complexContent>
 </xsd:complexType>
 <xsd:complexType name="AlbumResult">
  <xsd:all>
   <xsd:element name="artist" type="xsd:string"/>
   <xsd:element name="album" type="xsd:string"/>
   <xsd:element name="year" type="xsd:int"/>
  </xsd:all>
 </xsd:complexType>
 <xsd:complexType name="SongResult">
  <xsd:all>
   <xsd:element name="artist" type="xsd:string"/>
   <xsd:element name="song" type="xsd:string"/>
  </xsd:all>
 </xsd:complexType>
 <xsd:complexType name="LyricsResult">
  <xsd:all>
   <xsd:element name="artist" type="xsd:string"/>
   <xsd:element name="song" type="xsd:string"/>
   <xsd:element name="lyrics" type="xsd:string"/>
   <xsd:element name="url" type="xsd:string"/>
  </xsd:all>
 </xsd:complexType>
 <xsd:complexType name="SOTDResult">
  <xsd:all>
   <xsd:element name="artist" type="xsd:string"/>
   <xsd:element name="song" type="xsd:string"/>
   <xsd:element name="nominatedBy" type="xsd:string"/>
   <xsd:element name="reason" type="xsd:string"/>
   <xsd:element name="lyrics" type="xsd:string"/>
  </xsd:all>
 </xsd:complexType>
 <xsd:complexType name="AlbumDataArray">
  <xsd:complexContent>
   <xsd:restriction base="SOAP-ENC:Array">
    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="tns:AlbumData[]"/>
   </xsd:restriction>
  </xsd:complexContent>
 </xsd:complexType>
 <xsd:complexType name="AlbumData">
  <xsd:all>
   <xsd:element name="album" type="xsd:string"/>
   <xsd:element name="year" type="xsd:int"/>
   <xsd:element name="amazonLink" type="xsd:string"/>
   <xsd:element name="imgUrl" type="xsd:string"/>
   <xsd:element name="url" type="xsd:string"/>
   <xsd:element name="songs" type="tns:ArrayOfstring"/>
  </xsd:all>
 </xsd:complexType>
 <xsd:complexType name="TopSongsArray">
  <xsd:complexContent>
   <xsd:restriction base="SOAP-ENC:Array">
    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="tns:TopSong[]"/>
   </xsd:restriction>
  </xsd:complexContent>
 </xsd:complexType>
 <xsd:complexType name="TopSong">
  <xsd:all>
   <xsd:element name="rank" type="xsd:int"/>
   <xsd:element name="artist" type="xsd:string"/>
   <xsd:element name="song" type="xsd:string"/>
   <xsd:element name="image" type="xsd:string"/>
   <xsd:element name="itunes" type="xsd:string"/>
   <xsd:element name="url" type="xsd:string"/>
  </xsd:all>
 </xsd:complexType>
</xsd:schema>
</types><message name="checkSongExistsRequest"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /></message><message name="checkSongExistsResponse"><part name="return" type="xsd:boolean" /></message><message name="searchArtistsRequest"><part name="searchString" type="xsd:string" /></message><message name="searchArtistsResponse"><part name="return" type="tns:ArrayOfstring" /></message><message name="searchAlbumsRequest"><part name="artist" type="xsd:string" /><part name="album" type="xsd:string" /><part name="year" type="xsd:int" /></message><message name="searchAlbumsResponse"><part name="return" type="tns:AlbumResultArray" /></message><message name="searchSongsRequest"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /></message><message name="searchSongsResponse"><part name="return" type="tns:SongResult" /></message><message name="getSOTDRequest"></message><message name="getSOTDResponse"><part name="return" type="tns:SOTDResult" /></message><message name="getSongRequest"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /></message><message name="getSongResponse"><part name="return" type="tns:LyricsResult" /></message><message name="getSongResultRequest"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /></message><message name="getSongResultResponse"><part name="songResult" type="tns:LyricsResult" /></message><message name="getArtistRequest"><part name="artist" type="xsd:string" /></message><message name="getArtistResponse"><part name="artist" type="xsd:string" /><part name="albums" type="tns:AlbumDataArray" /></message><message name="getAlbumRequest"><part name="artist" type="xsd:string" /><part name="album" type="xsd:string" /><part name="year" type="xsd:int" /></message><message name="getAlbumResponse"><part name="artist" type="xsd:string" /><part name="album" type="xsd:string" /><part name="year" type="xsd:int" /><part name="amazonLink" type="xsd:string" /><part name="imgUrl" type="xsd:string" /><part name="url" type="xsd:string" /><part name="songs" type="tns:ArrayOfstring" /></message><message name="getHometownRequest"><part name="artist" type="xsd:string" /></message><message name="getHometownResponse"><part name="country" type="xsd:string" /><part name="state" type="xsd:string" /><part name="hometown" type="xsd:string" /></message><message name="getTopSongsRequest"><part name="limit" type="xsd:string" /></message><message name="getTopSongsResponse"><part name="topSongs" type="tns:TopSongsArray" /></message><message name="postArtistRequest"><part name="overwriteIfExists" type="xsd:boolean" /><part name="artist" type="xsd:string" /><part name="albums" type="tns:AlbumDataArray" /></message><message name="postArtistResponse"><part name="artist" type="xsd:string" /><part name="dataUsed" type="xsd:boolean" /><part name="message" type="xsd:string" /></message><message name="postAlbumRequest"><part name="overwriteIfExists" type="xsd:boolean" /><part name="artist" type="xsd:string" /><part name="album" type="xsd:string" /><part name="year" type="xsd:int" /><part name="asin" type="xsd:string" /><part name="songs" type="tns:ArrayOfstring" /></message><message name="postAlbumResponse"><part name="artist" type="xsd:string" /><part name="album" type="xsd:string" /><part name="year" type="xsd:int" /><part name="dataUsed" type="xsd:boolean" /><part name="message" type="xsd:string" /></message><message name="postSongRequest"><part name="overwriteIfExists" type="xsd:boolean" /><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /><part name="lyrics" type="xsd:string" /><part name="onAlbums" type="tns:AlbumResultArray" /></message><message name="postSongResponse"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /><part name="dataUsed" type="xsd:boolean" /><part name="message" type="xsd:string" /></message><message name="postSong_flagsRequest"><part name="overwriteIfExists" type="xsd:boolean" /><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /><part name="lyrics" type="xsd:string" /><part name="onAlbums" type="tns:AlbumResultArray" /><part name="flags" type="xsd:string" /></message><message name="postSong_flagsResponse"><part name="artist" type="xsd:string" /><part name="song" type="xsd:string" /><part name="dataUsed" type="xsd:boolean" /><part name="message" type="xsd:string" /></message><portType name="LyricWikiPortType"><operation name="checkSongExists"><documentation>Check if a song exists in the LyricWiki database yet</documentation><input message="tns:checkSongExistsRequest"/><output message="tns:checkSongExistsResponse"/></operation><operation name="searchArtists"><documentation>Search for an artist by name and return up to 10 close matches</documentation><input message="tns:searchArtistsRequest"/><output message="tns:searchArtistsResponse"/></operation><operation name="searchAlbums"><documentation>Search for an album on LyricWiki and return up to 10 close matches (year optional)</documentation><input message="tns:searchAlbumsRequest"/><output message="tns:searchAlbumsResponse"/></operation><operation name="searchSongs"><documentation>Search for a song on LyricWiki and get up to 10 close matches</documentation><input message="tns:searchSongsRequest"/><output message="tns:searchSongsResponse"/></operation><operation name="getSOTD"><documentation>Get the lyrics for a the current Song of the Day on LyricWiki</documentation><input message="tns:getSOTDRequest"/><output message="tns:getSOTDResponse"/></operation><operation name="getSong"><documentation>Get the lyrics for a LyricWiki song with the exact artist and song match</documentation><input message="tns:getSongRequest"/><output message="tns:getSongResponse"/></operation><operation name="getSongResult"><documentation>Get the lyrics for a LyricWiki song with the exact artist and song match</documentation><input message="tns:getSongResultRequest"/><output message="tns:getSongResultResponse"/></operation><operation name="getArtist"><documentation>Gets the entire discography for an artist</documentation><input message="tns:getArtistRequest"/><output message="tns:getArtistResponse"/></operation><operation name="getAlbum"><documentation>Gets the track listing, album cover, and amazon link for an album</documentation><input message="tns:getAlbumRequest"/><output message="tns:getAlbumResponse"/></operation><operation name="getHometown"><documentation>Gets the hometown for an artist</documentation><input message="tns:getHometownRequest"/><output message="tns:getHometownResponse"/></operation><operation name="getTopSongs"><documentation>Gets the most popular songs. Currently, this data comes from the iTunes Top 100 feed, so the largest possible value of &quot;limit&quot; is 100.  Limit defaults to 10.</documentation><input message="tns:getTopSongsRequest"/><output message="tns:getTopSongsResponse"/></operation><operation name="postArtist"><documentation>Posts data of an artist and their discography.  Will create any missing album pages based on the data passed in.</documentation><input message="tns:postArtistRequest"/><output message="tns:postArtistResponse"/></operation><operation name="postAlbum"><documentation>Posts data for a single album including its track-list and optionally the amazon ASIN</documentation><input message="tns:postAlbumRequest"/><output message="tns:postAlbumResponse"/></operation><operation name="postSong"><documentation>Posts data for a single song.  If correcting exiting lyrics, make sure overwriteIfExists is set to true.  In the onAlbums array, if artist is left blank, it will default to the artist of the song.</documentation><input message="tns:postSongRequest"/><output message="tns:postSongResponse"/></operation><operation name="postSong_flags"><documentation>Posts data for a single song.  If correcting exiting lyrics, make sure overwriteIfExists is set to true.  In the onAlbums array, if artist is left blank, it will default to the artist of the song.For the flags parameter, this is a comma-separated list of flags. For example, pass 'LW_SANDBOX' in to use the sandbox for testing and not actually update the site.</documentation><input message="tns:postSong_flagsRequest"/><output message="tns:postSong_flagsResponse"/></operation></portType><binding name="LyricWikiBinding" type="tns:LyricWikiPortType"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="checkSongExists"><soap:operation soapAction="urn:LyricWiki#checkSongExists" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="searchArtists"><soap:operation soapAction="urn:LyricWiki#searchArtists" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="searchAlbums"><soap:operation soapAction="urn:LyricWiki#searchAlbums" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="searchSongs"><soap:operation soapAction="urn:LyricWiki#searchSongs" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getSOTD"><soap:operation soapAction="urn:LyricWiki#getSOTD" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getSong"><soap:operation soapAction="urn:LyricWiki#getSong" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getSongResult"><soap:operation soapAction="urn:LyricWiki#getSongResult" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getArtist"><soap:operation soapAction="urn:LyricWiki#getArtist" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getAlbum"><soap:operation soapAction="urn:LyricWiki#getAlbum" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getHometown"><soap:operation soapAction="urn:LyricWiki#getHometown" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="getTopSongs"><soap:operation soapAction="urn:LyricWiki#getTopSongs" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="postArtist"><soap:operation soapAction="urn:LyricWiki#postArtist" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="postAlbum"><soap:operation soapAction="urn:LyricWiki#postAlbum" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="postSong"><soap:operation soapAction="urn:LyricWiki#postSong" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="postSong_flags"><soap:operation soapAction="urn:LyricWiki#postSong_flags" style="rpc"/><input><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:LyricWiki" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation></binding><service name="LyricWiki"><port name="LyricWikiPort" binding="tns:LyricWikiBinding"><soap:address location="http://lyrics.wikia.com/server.php"/></port></service></definitions>